import Accordion from "../../ui/Accordion";

const FAQSection = () => {
  const questions = [
    {
      title: "چطور می‌تونم پروژه‌ای رو در فریلنسو ثبت کنم؟",
      description:
        "برای ثبت پروژه، ابتدا وارد حساب کاربری‌تون بشید یا یک حساب جدید بسازید. سپس از داشبورد، بخش پروژه ها و گزینه‌ی «ایجاد پروژه» رو انتخاب کنید. در ادامه، مشخصات پروژه مثل عنوان، توضیحات، دسته‌بندی، بودجه و مهلت تحویل رو وارد کرده و پروژه رو ثبت کنید. فریلنسرها پس از بررسی، برای همکاری درخواست ارسال خواهند کرد.",
    },
    {
      title: "چطور می‌تونم به عنوان فریلنسر در فریلنسو فعالیت کنم؟",
      description:
        "بعد از ثبت‌نام به عنوان فریلنسر، پروفایل خودتون رو تکمیل کنید. سپس به لیست پروژه‌های فعال دسترسی دارید و می‌تونید برای هر پروژه‌ای که مناسب شماست، پیشنهاد ارسال کنید و با کارفرما مذاکره کنید",
    },
    {
      title: "بعد از ثبت‌نام، چقدر طول می‌کشه تا حسابم توسط ادمین تایید بشه؟",
      description:
        "بعد از ثبت‌نام و تکمیل اطلاعات پروفایل، حساب شما برای بررسی به تیم فریلنسو ارسال می‌شه. معمولاً فرایند تأیید کمتر از ۲۴ ساعت زمان می‌بره. در این مرحله، اطلاعات شما بررسی می‌شن تا از رعایت استانداردهای فریلنسو اطمینان حاصل بشه.",
    },
  ];
  return (
    <div className="container space-y-4 p-6 py-20">
      <h4 className="font-semibold text-lg text-shadow-sm text-blue-950">
        سوالات متداول کاربران
      </h4>
      <div className="flex flex-col gap-4">
        {questions.map((question, index) => (
          <Accordion key={index} {...question} />
        ))}
      </div>
    </div>
  );
};

export default FAQSection;
